MCUdude/MightyCore/avr/boards.txt
1284.menu.clock.7_3728MHz_external=External 7.3728 MHz
1284.menu.clock.7_3728MHz_external.upload.default_speed=115200
1284.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.7_3728MHz_external.build.clkpr=
1284.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

1284.menu.clock.6MHz_external=External 6 MHz
1284.menu.clock.6MHz_external.upload.default_speed=57600
1284.menu.clock.6MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.6MHz_external.build.clkpr=
1284.menu.clock.6MHz_external.build.f_cpu=6000000L

1284.menu.clock.4MHz_external=External 4 MHz
1284.menu.clock.4MHz_external.upload.default_speed=9600
1284.menu.clock.4MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.4MHz_external.build.clkpr=
1284.menu.clock.4MHz_external.build.f_cpu=4000000L

1284.menu.clock.3_6864MHz_external=External 3.6864 MHz
1284.menu.clock.3_6864MHz_external.upload.default_speed=115200
1284.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.3_6864MHz_external.build.clkpr=
1284.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

1284.menu.clock.2MHz_external=External 2 MHz
1284.menu.clock.2MHz_external.upload.default_speed=9600
1284.menu.clock.2MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.2MHz_external.build.clkpr=
1284.menu.clock.2MHz_external.build.f_cpu=2000000L

1284.menu.clock.1_8432MHz_external=External 1.8432 MHz
1284.menu.clock.1_8432MHz_external.upload.default_speed=115200
1284.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.1_8432MHz_external.build.clkpr=
1284.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

1284.menu.clock.1MHz_external=External 1 MHz
1284.menu.clock.1MHz_external.upload.default_speed=9600
1284.menu.clock.1MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.1MHz_external.build.clkpr=
1284.menu.clock.1MHz_external.build.f_cpu=1000000L

1284.menu.clock.8MHz_internal=Internal 8 MHz
1284.menu.clock.8MHz_internal.upload.default_speed=38400
1284.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
1284.menu.clock.8MHz_internal.build.clkpr=
1284.menu.clock.8MHz_internal.build.f_cpu=8000000L

1284.menu.clock.4MHz_internal=Internal 4 MHz
1284.menu.clock.4MHz_internal.upload.default_speed=9600
1284.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
1284.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
1284.menu.clock.4MHz_internal.build.f_cpu=4000000L

1284.menu.clock.2MHz_internal=Internal 2 MHz
1284.menu.clock.2MHz_internal.upload.default_speed=9600
1284.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
1284.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
1284.menu.clock.2MHz_internal.build.f_cpu=2000000L

1284.menu.clock.1MHz_internal=Internal 1 MHz
1284.menu.clock.1MHz_internal.upload.default_speed=9600
1284.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
1284.menu.clock.1MHz_internal.build.clkpr=
1284.menu.clock.1MHz_internal.build.f_cpu=1000000L



###########################
#### ATmega644/A/P/PA  ####
###########################

# General
644.name=ATmega644
644.upload.tool=avrdude
644.upload.maximum_data_size=4096
644.bootloader.tool=avrdude
644.bootloader.unlock_bits=0xff
644.bootloader.lock_bits=0xff
644.build.core=MCUdude_corefiles
644.build.board=AVR_ATmega644
644.build.extra_flags={build.clkpr}

# JTAG pins
644.menu.JTAG.disabled=JTAG disabled
644.menu.JTAG.disabled.bootloader.jtag_nibble=d
644.menu.JTAG.enabled=JTAG enabled
644.menu.JTAG.enabled.bootloader.jtag_nibble=9

# Upload port select
644.menu.bootloader.uart0=Yes (UART0)
644.menu.bootloader.uart0.upload.maximum_size=65024
644.menu.bootloader.uart0.upload.protocol=urclock
644.menu.bootloader.uart0.upload.uartpins=uart0_rxd0_txd1
644.menu.bootloader.uart0.build.export_merged_output=true
644.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

644.menu.bootloader.uart1=Yes (UART1)
644.menu.bootloader.uart1.upload.maximum_size=65024
644.menu.bootloader.uart1.upload.protocol=urclock
644.menu.bootloader.uart1.upload.uartpins=uart1_rxd2_txd3
644.menu.bootloader.uart1.build.export_merged_output=true
644.menu.bootloader.uart1.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

644.menu.bootloader.no_bootloader=No bootloader
644.menu.bootloader.no_bootloader.upload.maximum_size=65536
644.menu.bootloader.no_bootloader.build.export_merged_output=false
644.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
644.menu.eeprom.keep=EEPROM retained
644.menu.eeprom.keep.bootloader.high_fuses=0x{bootloader.jtag_nibble}7
644.menu.eeprom.erase=EEPROM not retained
644.menu.eeprom.erase.bootloader.high_fuses=0x{bootloader.jtag_nibble}f

# Baud rate
644.menu.baudrate.default=Default
644.menu.baudrate.default.upload.speed={upload.default_speed}
644.menu.baudrate.1000000=1000000
644.menu.baudrate.1000000.upload.speed=1000000
644.menu.baudrate.500000=500000
644.menu.baudrate.500000.upload.speed=500000
644.menu.baudrate.460800=460800
644.menu.baudrate.460800.upload.speed=460800
644.menu.baudrate.250000=250000
644.menu.baudrate.250000.upload.speed=250000
644.menu.baudrate.230400=230400
644.menu.baudrate.230400.upload.speed=230400
644.menu.baudrate.125000=125000
644.menu.baudrate.125000.upload.speed=125000
644.menu.baudrate.115200=115200
644.menu.baudrate.115200.upload.speed=115200
644.menu.baudrate.57600=57600
644.menu.baudrate.57600.upload.speed=57600
644.menu.baudrate.38400=38400
644.menu.baudrate.38400.upload.speed=38400
644.menu.baudrate.19200=19200
644.menu.baudrate.19200.upload.speed=19200
644.menu.baudrate.9600=9600
644.menu.baudrate.9600.upload.speed=9600
644.menu.baudrate.4800=4800
644.menu.baudrate.4800.upload.speed=4800

# Pinouts
644.menu.pinout.standard=Standard pinout
644.menu.pinout.standard.build.variant=standard
644.menu.pinout.standard.build.bootloader_led=led+b0
644.menu.pinout.bobuino=Bobuino pinout
644.menu.pinout.bobuino.build.variant=bobuino
644.menu.pinout.bobuino.build.bootloader_led=led+b7
644.menu.pinout.sanguino=Sanguino pinout
644.menu.pinout.sanguino.build.variant=sanguino
644.menu.pinout.sanguino.build.bootloader_led=led+b0

