MCUdude/MightyCore/avr/boards.txt
# Variants
324.menu.variant.modelP=324P
324.menu.variant.modelP.bootloader.cksel_bits=0111
324.menu.variant.modelP.bootloader.cfd_bit=1
324.menu.variant.modelP.build.mcu=atmega324p
324.menu.variant.modelPA=324PA
324.menu.variant.modelPA.bootloader.cksel_bits=0111
324.menu.variant.modelPA.bootloader.cfd_bit=1
324.menu.variant.modelPA.build.mcu=atmega324pa
324.menu.variant.modelA=324A
324.menu.variant.modelA.bootloader.cksel_bits=0111
324.menu.variant.modelA.bootloader.cfd_bit=1
324.menu.variant.modelA.build.mcu=atmega324a
324.menu.variant.modelPB=324PB
324.menu.variant.modelPB.bootloader.cksel_bits=1111
324.menu.variant.modelPB.bootloader.cfd_bit=0
324.menu.variant.modelPB.build.mcu=atmega324pb

# Brown out detection
324.menu.BOD.2v7=BOD 2.7V
324.menu.BOD.2v7.bootloader.extended_fuses=0b1111{bootloader.cfd_bit}101
324.menu.BOD.4v3=BOD 4.3V
324.menu.BOD.4v3.bootloader.extended_fuses=0b1111{bootloader.cfd_bit}100
324.menu.BOD.1v8=BOD 1.8V
324.menu.BOD.1v8.bootloader.extended_fuses=0b1111{bootloader.cfd_bit}110
324.menu.BOD.disabled=BOD disabled
324.menu.BOD.disabled.bootloader.extended_fuses=0b1111{bootloader.cfd_bit}111

# Compiler link time optimization
324.menu.LTO.Os_flto=LTO enabled
324.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
324.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
324.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
324.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

324.menu.LTO.Os=LTO disabled
324.menu.LTO.Os.compiler.c.extra_flags=
324.menu.LTO.Os.compiler.c.elf.extra_flags=
324.menu.LTO.Os.compiler.cpp.extra_flags=
324.menu.LTO.Os.ltoarcmd=avr-ar

# Clock frequencies
324.menu.clock.16MHz_external=External 16 MHz
324.menu.clock.16MHz_external.upload.default_speed=115200
324.menu.clock.16MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.16MHz_external.build.clkpr=
324.menu.clock.16MHz_external.build.f_cpu=16000000L

324.menu.clock.20MHz_external=External 20 MHz
324.menu.clock.20MHz_external.upload.default_speed=115200
324.menu.clock.20MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.20MHz_external.build.clkpr=
324.menu.clock.20MHz_external.build.f_cpu=20000000L

324.menu.clock.18_432MHz_external=External 18.4320 MHz
324.menu.clock.18_432MHz_external.upload.default_speed=115200
324.menu.clock.18_432MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.18_432MHz_external.build.clkpr=
324.menu.clock.18_432MHz_external.build.f_cpu=18432000L

324.menu.clock.14_7456MHz_external=External 14.7456 MHz
324.menu.clock.14_7456MHz_external.upload.default_speed=115200
324.menu.clock.14_7456MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.14_7456MHz_external.build.clkpr=
324.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

324.menu.clock.12MHz_external=External 12 MHz
324.menu.clock.12MHz_external.upload.default_speed=57600
324.menu.clock.12MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.12MHz_external.build.clkpr=
324.menu.clock.12MHz_external.build.f_cpu=12000000L

324.menu.clock.11_0592MHz_external=External 11.0592 MHz
324.menu.clock.11_0592MHz_external.upload.default_speed=115200
324.menu.clock.11_0592MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.11_0592MHz_external.build.clkpr=
324.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

324.menu.clock.9_216MHz_external=External 9.216 MHz
324.menu.clock.9_216MHz_external.upload.default_speed=115200
324.menu.clock.9_216MHz_external.bootloader.low_fuses=0xf7
324.menu.clock.9_216MHz_external.build.clkpr=
324.menu.clock.9_216MHz_external.build.f_cpu=9216000L

324.menu.clock.8MHz_external=External 8 MHz
324.menu.clock.8MHz_external.upload.default_speed=57600
324.menu.clock.8MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.8MHz_external.build.clkpr=
324.menu.clock.8MHz_external.build.f_cpu=8000000L

324.menu.clock.7_3728MHz_external=External 7.3728 MHz
324.menu.clock.7_3728MHz_external.upload.default_speed=115200
324.menu.clock.7_3728MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.7_3728MHz_external.build.clkpr=
324.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

324.menu.clock.6MHz_external=External 6 MHz
324.menu.clock.6MHz_external.upload.default_speed=57600
324.menu.clock.6MHz_external.bootloader.low_fuses=0xf7
324.menu.clock.6MHz_external.build.clkpr=
324.menu.clock.6MHz_external.build.f_cpu=6000000L

324.menu.clock.4MHz_external=External 4 MHz
324.menu.clock.4MHz_external.upload.default_speed=9600
324.menu.clock.4MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.4MHz_external.build.clkpr=
324.menu.clock.4MHz_external.build.f_cpu=4000000L

324.menu.clock.3_6864MHz_external=External 3.6864 MHz
324.menu.clock.3_6864MHz_external.upload.default_speed=115200
324.menu.clock.3_6864MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.3_6864MHz_external.build.clkpr=
324.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

324.menu.clock.2MHz_external=External 2 MHz
324.menu.clock.2MHz_external.upload.default_speed=9600
324.menu.clock.2MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.2MHz_external.build.clkpr=
324.menu.clock.2MHz_external.build.f_cpu=2000000L

324.menu.clock.1_8432MHz_external=External 1.8432 MHz
324.menu.clock.1_8432MHz_external.upload.default_speed=115200
324.menu.clock.1_8432MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.1_8432MHz_external.build.clkpr=
324.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

324.menu.clock.1MHz_external=External 1 MHz
324.menu.clock.1MHz_external.upload.default_speed=9600
324.menu.clock.1MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.1MHz_external.build.clkpr=
324.menu.clock.1MHz_external.build.f_cpu=1000000L

324.menu.clock.8MHz_internal=Internal 8 MHz
324.menu.clock.8MHz_internal.upload.default_speed=38400
324.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
324.menu.clock.8MHz_internal.build.clkpr=
324.menu.clock.8MHz_internal.build.f_cpu=8000000L

324.menu.clock.4MHz_internal=Internal 4 MHz
324.menu.clock.4MHz_internal.upload.default_speed=9600
324.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
324.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
324.menu.clock.4MHz_internal.build.f_cpu=4000000L

324.menu.clock.2MHz_internal=Internal 2 MHz
324.menu.clock.2MHz_internal.upload.default_speed=9600
324.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
324.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
324.menu.clock.2MHz_internal.build.f_cpu=2000000L

324.menu.clock.1MHz_internal=Internal 1 MHz
324.menu.clock.1MHz_internal.upload.default_speed=9600
324.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
324.menu.clock.1MHz_internal.build.clkpr=
324.menu.clock.1MHz_internal.build.f_cpu=1000000L



##########################
#### ATmega164A/P/PA  ####
##########################

# General
164.name=ATmega164
164.upload.tool=avrdude
164.upload.maximum_data_size=1024
164.bootloader.tool=avrdude
164.bootloader.unlock_bits=0xff
164.bootloader.lock_bits=0xff
164.build.core=MCUdude_corefiles
164.build.board=AVR_ATmega164
164.build.extra_flags={build.clkpr}

# JTAG pins
164.menu.JTAG.disabled=JTAG disabled
164.menu.JTAG.disabled.bootloader.jtag_nibble=d
164.menu.JTAG.enabled=JTAG enabled
164.menu.JTAG.enabled.bootloader.jtag_nibble=9

# Upload port select
164.menu.bootloader.uart0=Yes (UART0)
164.menu.bootloader.uart0.upload.maximum_size=16000
164.menu.bootloader.uart0.upload.protocol=urclock
164.menu.bootloader.uart0.upload.uartpins=uart0_rxd0_txd1
164.menu.bootloader.uart0.build.export_merged_output=true
164.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

164.menu.bootloader.uart1=Yes (UART1)
164.menu.bootloader.uart1.upload.maximum_size=16000
164.menu.bootloader.uart1.upload.protocol=urclock
164.menu.bootloader.uart1.upload.uartpins=uart1_rxd2_txd3
164.menu.bootloader.uart1.build.export_merged_output=true
164.menu.bootloader.uart1.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

164.menu.bootloader.no_bootloader=No bootloader
164.menu.bootloader.no_bootloader.upload.maximum_size=16384
164.menu.bootloader.no_bootloader.build.export_merged_output=false
164.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
164.menu.eeprom.keep=EEPROM retained
164.menu.eeprom.keep.bootloader.high_fuses=0x{bootloader.jtag_nibble}7
164.menu.eeprom.erase=EEPROM not retained
164.menu.eeprom.erase.bootloader.high_fuses=0x{bootloader.jtag_nibble}f

# Baud rate
164.menu.baudrate.default=Default
164.menu.baudrate.default.upload.speed={upload.default_speed}
164.menu.baudrate.1000000=1000000
164.menu.baudrate.1000000.upload.speed=1000000
164.menu.baudrate.500000=500000
164.menu.baudrate.500000.upload.speed=500000
164.menu.baudrate.460800=460800
164.menu.baudrate.460800.upload.speed=460800
164.menu.baudrate.250000=250000
164.menu.baudrate.250000.upload.speed=250000
164.menu.baudrate.230400=230400
164.menu.baudrate.230400.upload.speed=230400
164.menu.baudrate.125000=125000
164.menu.baudrate.125000.upload.speed=125000
164.menu.baudrate.115200=115200
164.menu.baudrate.115200.upload.speed=115200
164.menu.baudrate.57600=57600
164.menu.baudrate.57600.upload.speed=57600
164.menu.baudrate.38400=38400
164.menu.baudrate.38400.upload.speed=38400
164.menu.baudrate.19200=19200
164.menu.baudrate.19200.upload.speed=19200
164.menu.baudrate.9600=9600
164.menu.baudrate.9600.upload.speed=9600
164.menu.baudrate.4800=4800
164.menu.baudrate.4800.upload.speed=4800

# Pinouts
164.menu.pinout.standard=Standard pinout
164.menu.pinout.standard.build.variant=standard
164.menu.pinout.standard.build.bootloader_led=led+b0
164.menu.pinout.bobuino=Bobuino pinout
164.menu.pinout.bobuino.build.variant=bobuino
164.menu.pinout.bobuino.build.bootloader_led=led+b7
164.menu.pinout.sanguino=Sanguino pinout
164.menu.pinout.sanguino.build.variant=sanguino
164.menu.pinout.sanguino.build.bootloader_led=led+b0

