MCUdude/MightyCore/avr/boards.txt
# Variants
164.menu.variant.modelP=164P / 164PA
164.menu.variant.modelP.build.mcu=atmega164p
164.menu.variant.modelA=164A
164.menu.variant.modelA.build.mcu=atmega164a

# Brown out detection
164.menu.BOD.2v7=BOD 2.7V
164.menu.BOD.2v7.bootloader.extended_fuses=0xfd
164.menu.BOD.4v3=BOD 4.3V
164.menu.BOD.4v3.bootloader.extended_fuses=0xfc
164.menu.BOD.1v8=BOD 1.8V
164.menu.BOD.1v8.bootloader.extended_fuses=0xfe
164.menu.BOD.disabled=BOD disabled
164.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
164.menu.LTO.Os_flto=LTO enabled
164.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
164.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
164.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
164.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

164.menu.LTO.Os=LTO disabled
164.menu.LTO.Os.compiler.c.extra_flags=
164.menu.LTO.Os.compiler.c.elf.extra_flags=
164.menu.LTO.Os.compiler.cpp.extra_flags=
164.menu.LTO.Os.ltoarcmd=avr-ar

# Clock frequencies
164.menu.clock.16MHz_external=External 16 MHz
164.menu.clock.16MHz_external.upload.default_speed=115200
164.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.16MHz_external.build.clkpr=
164.menu.clock.16MHz_external.build.f_cpu=16000000L

164.menu.clock.20MHz_external=External 20 MHz
164.menu.clock.20MHz_external.upload.default_speed=115200
164.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.20MHz_external.build.clkpr=
164.menu.clock.20MHz_external.build.f_cpu=20000000L

164.menu.clock.18_432MHz_external=External 18.4320 MHz
164.menu.clock.18_432MHz_external.upload.default_speed=115200
164.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.18_432MHz_external.build.clkpr=
164.menu.clock.18_432MHz_external.build.f_cpu=18432000L

164.menu.clock.14_7456MHz_external=External 14.7456 MHz
164.menu.clock.14_7456MHz_external.upload.default_speed=115200
164.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.14_7456MHz_external.build.clkpr=
164.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

164.menu.clock.12MHz_external=External 12 MHz
164.menu.clock.12MHz_external.upload.default_speed=57600
164.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.12MHz_external.build.clkpr=
164.menu.clock.12MHz_external.build.f_cpu=12000000L

164.menu.clock.11_0592MHz_external=External 11.0592 MHz
164.menu.clock.11_0592MHz_external.upload.default_speed=115200
164.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.11_0592MHz_external.build.clkpr=
164.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

164.menu.clock.9_216MHz_external=External 9.216 MHz
164.menu.clock.9_216MHz_external.upload.default_speed=115200
164.menu.clock.9_216MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.9_216MHz_external.build.clkpr=
164.menu.clock.9_216MHz_external.build.f_cpu=9216000L

164.menu.clock.8MHz_external=External 8 MHz
164.menu.clock.8MHz_external.upload.default_speed=57600
164.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.8MHz_external.build.clkpr=
164.menu.clock.8MHz_external.build.f_cpu=8000000L

164.menu.clock.6MHz_external=External 6 MHz
164.menu.clock.6MHz_external.upload.default_speed=57600
164.menu.clock.6MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.6MHz_external.build.clkpr=
164.menu.clock.6MHz_external.build.f_cpu=6000000L

164.menu.clock.7_3728MHz_external=External 7.3728 MHz
164.menu.clock.7_3728MHz_external.upload.default_speed=115200
164.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.7_3728MHz_external.build.clkpr=
164.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

164.menu.clock.4MHz_external=External 4 MHz
164.menu.clock.4MHz_external.upload.default_speed=9600
164.menu.clock.4MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.4MHz_external.build.clkpr=
164.menu.clock.4MHz_external.build.f_cpu=4000000L

164.menu.clock.3_6864MHz_external=External 3.6864 MHz
164.menu.clock.3_6864MHz_external.upload.default_speed=115200
164.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.3_6864MHz_external.build.clkpr=
164.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

164.menu.clock.2MHz_external=External 2 MHz
164.menu.clock.2MHz_external.upload.default_speed=9600
164.menu.clock.2MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.2MHz_external.build.clkpr=
164.menu.clock.2MHz_external.build.f_cpu=2000000L

164.menu.clock.1_8432MHz_external=External 1.8432 MHz
164.menu.clock.1_8432MHz_external.upload.default_speed=115200
164.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.1_8432MHz_external.build.clkpr=
164.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

164.menu.clock.1MHz_external=External 1 MHz
164.menu.clock.1MHz_external.upload.default_speed=9600
164.menu.clock.1MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.1MHz_external.build.clkpr=
164.menu.clock.1MHz_external.build.f_cpu=1000000L

164.menu.clock.8MHz_internal=Internal 8 MHz
164.menu.clock.8MHz_internal.upload.default_speed=38400
164.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
164.menu.clock.8MHz_internal.build.clkpr=
164.menu.clock.8MHz_internal.build.f_cpu=8000000L

164.menu.clock.4MHz_internal=Internal 4 MHz
164.menu.clock.4MHz_internal.upload.default_speed=9600
164.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
164.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
164.menu.clock.4MHz_internal.build.f_cpu=4000000L

164.menu.clock.2MHz_internal=Internal 2 MHz
164.menu.clock.2MHz_internal.upload.default_speed=9600
164.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
164.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
164.menu.clock.2MHz_internal.build.f_cpu=2000000L

164.menu.clock.1MHz_internal=Internal 1 MHz
164.menu.clock.1MHz_internal.upload.default_speed=9600
164.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
164.menu.clock.1MHz_internal.build.clkpr=
164.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
#### ATmega32/A  ####
#####################

# General
32.name=ATmega32
32.upload.tool=avrdude
32.upload.maximum_data_size=2048
32.bootloader.tool=avrdude
32.bootloader.unlock_bits=0xff
32.bootloader.lock_bits=0xff
32.bootloader.low_fuses=0b{bootloader.bod_bits}{bootloader.sut_cksel_bits}
32.bootloader.high_fuses=0b1{bootloader.jtag_bit}0{bootloader.ckopt_bit}{bootloader.eesave_bit}111
32.build.core=MCUdude_corefiles
32.build.board=AVR_ATmega32
32.build.mcu=atmega32

# JTAG pins
32.menu.JTAG.disabled=JTAG disabled
32.menu.JTAG.disabled.bootloader.jtag_bit=1
32.menu.JTAG.enabled=JTAG enabled
32.menu.JTAG.enabled.bootloader.jtag_bit=0

# Upload port select
32.menu.bootloader.uart0=Yes (UART0)
32.menu.bootloader.uart0.upload.maximum_size=32384
32.menu.bootloader.uart0.upload.protocol=urclock
32.menu.bootloader.uart0.upload.uartpins=uart0_rxd0_txd1
32.menu.bootloader.uart0.build.export_merged_output=true
32.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

32.menu.bootloader.no_bootloader=No bootloader
32.menu.bootloader.no_bootloader.upload.maximum_size=32768
32.menu.bootloader.no_bootloader.build.export_merged_output=false
32.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
32.menu.eeprom.keep=EEPROM retained
32.menu.eeprom.keep.bootloader.eesave_bit=0
32.menu.eeprom.erase=EEPROM not retained
32.menu.eeprom.erase.bootloader.eesave_bit=1

# Baud rate
32.menu.baudrate.default=Default
32.menu.baudrate.default.upload.speed={upload.default_speed}
32.menu.baudrate.1000000=1000000
32.menu.baudrate.1000000.upload.speed=1000000
32.menu.baudrate.500000=500000
32.menu.baudrate.500000.upload.speed=500000
32.menu.baudrate.460800=460800
32.menu.baudrate.460800.upload.speed=460800
32.menu.baudrate.250000=250000
32.menu.baudrate.250000.upload.speed=250000
32.menu.baudrate.230400=230400
32.menu.baudrate.230400.upload.speed=230400
32.menu.baudrate.125000=125000
32.menu.baudrate.125000.upload.speed=125000
32.menu.baudrate.115200=115200
32.menu.baudrate.115200.upload.speed=115200
32.menu.baudrate.57600=57600
32.menu.baudrate.57600.upload.speed=57600
32.menu.baudrate.38400=38400
32.menu.baudrate.38400.upload.speed=38400
32.menu.baudrate.19200=19200
32.menu.baudrate.19200.upload.speed=19200
32.menu.baudrate.9600=9600
32.menu.baudrate.9600.upload.speed=9600
32.menu.baudrate.4800=4800
32.menu.baudrate.4800.upload.speed=4800

# Pinouts
32.menu.pinout.standard=Standard pinout
32.menu.pinout.standard.build.variant=standard
32.menu.pinout.standard.build.bootloader_led=led+b0
32.menu.pinout.bobuino=Bobuino pinout
32.menu.pinout.bobuino.build.variant=bobuino
32.menu.pinout.bobuino.build.bootloader_led=led+b7
32.menu.pinout.sanguino=Sanguino pinout
32.menu.pinout.sanguino.build.variant=sanguino
32.menu.pinout.sanguino.build.bootloader_led=led+b0

