MCUdude/MightyCore/avr/boards.txt
# Brown out detection - This is the first part of the low fuse bit concatenation
32.menu.BOD.2v7=BOD 2.7V
32.menu.BOD.2v7.bootloader.bod_bits=10
32.menu.BOD.4v0=BOD 4.0V
32.menu.BOD.4v0.bootloader.bod_bits=00
32.menu.BOD.disabled=BOD disabled
32.menu.BOD.disabled.bootloader.bod_bits=11

# Compiler link time optimization
32.menu.LTO.Os_flto=LTO enabled
32.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
32.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
32.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
32.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

32.menu.LTO.Os=LTO disabled
32.menu.LTO.Os.compiler.c.extra_flags=
32.menu.LTO.Os.compiler.c.elf.extra_flags=
32.menu.LTO.Os.compiler.cpp.extra_flags=
32.menu.LTO.Os.ltoarcmd=avr-ar

# Clock frequencies - This is the second part of the low fuse bit concatenation
32.menu.clock.16MHz_external=External 16 MHz
32.menu.clock.16MHz_external.upload.default_speed=115200
32.menu.clock.16MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.16MHz_external.bootloader.ckopt_bit=0
32.menu.clock.16MHz_external.build.f_cpu=16000000L

32.menu.clock.20MHz_external=External 20 MHz
32.menu.clock.20MHz_external.upload.default_speed=115200
32.menu.clock.20MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.20MHz_external.bootloader.ckopt_bit=0
32.menu.clock.20MHz_external.build.f_cpu=20000000L

32.menu.clock.18_432MHz_external=External 18.4320 MHz
32.menu.clock.18_432MHz_external.upload.default_speed=115200
32.menu.clock.18_432MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.18_432MHz_external.bootloader.ckopt_bit=0
32.menu.clock.18_432MHz_external.build.f_cpu=18432000L

32.menu.clock.14_7456MHz_external=External 14.7456 MHz
32.menu.clock.14_7456MHz_external.upload.default_speed=115200
32.menu.clock.14_7456MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.14_7456MHz_external.bootloader.ckopt_bit=0
32.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

32.menu.clock.12MHz_external=External 12 MHz
32.menu.clock.12MHz_external.upload.default_speed=57600
32.menu.clock.12MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.12MHz_external.bootloader.ckopt_bit=0
32.menu.clock.12MHz_external.build.f_cpu=12000000L

32.menu.clock.11_0592MHz_external=External 11.0592 MHz
32.menu.clock.11_0592MHz_external.upload.default_speed=115200
32.menu.clock.11_0592MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.11_0592MHz_external.bootloader.ckopt_bit=0
32.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

32.menu.clock.9_216MHz_external=External 9.216 MHz
32.menu.clock.9_216MHz_external.upload.default_speed=115200
32.menu.clock.9_216MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.9_216MHz_external.bootloader.ckopt_bit=0
32.menu.clock.9_216MHz_external.build.f_cpu=9216000L

32.menu.clock.8MHz_external=External 8 MHz
32.menu.clock.8MHz_external.upload.default_speed=57600
32.menu.clock.8MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.8MHz_external.bootloader.ckopt_bit=0
32.menu.clock.8MHz_external.build.f_cpu=8000000L

32.menu.clock.7_3728MHz_external=External 7.3728 MHz
32.menu.clock.7_3728MHz_external.upload.default_speed=115200
32.menu.clock.7_3728MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.7_3728MHz_external.bootloader.ckopt_bit=0
32.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

32.menu.clock.6MHz_external=External 6 MHz
32.menu.clock.6MHz_external.upload.default_speed=57600
32.menu.clock.6MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.6MHz_external.bootloader.ckopt_bit=0
32.menu.clock.6MHz_external.build.f_cpu=6000000L

32.menu.clock.4MHz_external=External 4 MHz
32.menu.clock.4MHz_external.upload.default_speed=9600
32.menu.clock.4MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.4MHz_external.bootloader.ckopt_bit=0
32.menu.clock.4MHz_external.build.f_cpu=4000000L

32.menu.clock.3_6864MHz_external=External 3.6864 MHz
32.menu.clock.3_6864MHz_external.upload.default_speed=115200
32.menu.clock.3_6864MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.3_6864MHz_external.bootloader.ckopt_bit=0
32.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

32.menu.clock.2MHz_external=External 2 MHz
32.menu.clock.2MHz_external.upload.default_speed=9600
32.menu.clock.2MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.2MHz_external.bootloader.ckopt_bit=0
32.menu.clock.2MHz_external.build.f_cpu=2000000L

32.menu.clock.1_8432MHz_external=External 1.8432 MHz
32.menu.clock.1_8432MHz_external.upload.default_speed=115200
32.menu.clock.1_8432MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.1_8432MHz_external.bootloader.ckopt_bit=0
32.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

32.menu.clock.1MHz_external=External 1 MHz
32.menu.clock.1MHz_external.upload.default_speed=9600
32.menu.clock.1MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.1MHz_external.bootloader.ckopt_bit=0
32.menu.clock.1MHz_external.build.f_cpu=1000000L

32.menu.clock.8MHz_internal=Internal 8 MHz
32.menu.clock.8MHz_internal.upload.default_speed=38400
32.menu.clock.8MHz_internal.bootloader.sut_cksel_bits=100100
32.menu.clock.8MHz_internal.bootloader.ckopt_bit=1
32.menu.clock.8MHz_internal.build.f_cpu=8000000L

32.menu.clock.4MHz_internal=Internal 4 MHz
32.menu.clock.4MHz_internal.upload.default_speed=9600
32.menu.clock.4MHz_internal.bootloader.sut_cksel_bits=100001
32.menu.clock.4MHz_internal.bootloader.ckopt_bit=1
32.menu.clock.4MHz_internal.build.f_cpu=4000000L

32.menu.clock.2MHz_internal=Internal 2 MHz
32.menu.clock.2MHz_internal.upload.default_speed=9600
32.menu.clock.2MHz_internal.bootloader.sut_cksel_bits=100001
32.menu.clock.2MHz_internal.bootloader.ckopt_bit=1
32.menu.clock.2MHz_internal.build.f_cpu=2000000L

32.menu.clock.1MHz_internal=Internal 1 MHz
32.menu.clock.1MHz_internal.upload.default_speed=9600
32.menu.clock.1MHz_internal.bootloader.sut_cksel_bits=100001
32.menu.clock.1MHz_internal.bootloader.ckopt_bit=1
32.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
#### ATmega16/A  ####
#####################

# General
16.name=ATmega16
16.upload.tool=avrdude
16.upload.maximum_data_size=1024
16.bootloader.tool=avrdude
16.bootloader.unlock_bits=0xff
16.bootloader.lock_bits=0xff
16.bootloader.low_fuses=0b{bootloader.bod_bits}{bootloader.sut_cksel_bits}
16.bootloader.high_fuses=0b1{bootloader.jtag_bit}0{bootloader.ckopt_bit}{bootloader.eesave_bit}111
16.build.core=MCUdude_corefiles
16.build.board=AVR_ATmega16
16.build.mcu=atmega16

# JTAG pins
16.menu.JTAG.disabled=JTAG disabled
16.menu.JTAG.disabled.bootloader.jtag_bit=1
16.menu.JTAG.enabled=JTAG enabled
16.menu.JTAG.enabled.bootloader.jtag_bit=0

# Upload port select
16.menu.bootloader.uart0=Yes (UART0)
16.menu.bootloader.uart0.upload.maximum_size=16000
16.menu.bootloader.uart0.upload.protocol=urclock
16.menu.bootloader.uart0.upload.uartpins=uart0_rxd0_txd1
16.menu.bootloader.uart0.build.export_merged_output=true
16.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

