MCUdude/MightyCore/avr/boards.txt
16.menu.clock.1MHz_external=External 1 MHz
16.menu.clock.1MHz_external.upload.default_speed=9600
16.menu.clock.1MHz_external.bootloader.sut_cksel_bits=111111
16.menu.clock.1MHz_external.bootloader.ckopt_bit=0
16.menu.clock.1MHz_external.build.f_cpu=1000000L

16.menu.clock.8MHz_internal=Internal 8 MHz
16.menu.clock.8MHz_internal.upload.default_speed=38400
16.menu.clock.8MHz_internal.bootloader.sut_cksel_bits=100100
16.menu.clock.8MHz_internal.bootloader.ckopt_bit=1
16.menu.clock.8MHz_internal.build.f_cpu=8000000L

16.menu.clock.4MHz_internal=Internal 4 MHz
16.menu.clock.4MHz_internal.upload.default_speed=9600
16.menu.clock.4MHz_internal.bootloader.sut_cksel_bits=100001
16.menu.clock.4MHz_internal.bootloader.ckopt_bit=1
16.menu.clock.4MHz_internal.build.f_cpu=4000000L

16.menu.clock.2MHz_internal=Internal 2 MHz
16.menu.clock.2MHz_internal.upload.default_speed=9600
16.menu.clock.2MHz_internal.bootloader.sut_cksel_bits=100001
16.menu.clock.2MHz_internal.bootloader.ckopt_bit=1
16.menu.clock.2MHz_internal.build.f_cpu=2000000L

16.menu.clock.1MHz_internal=Internal 1 MHz
16.menu.clock.1MHz_internal.upload.default_speed=9600
16.menu.clock.1MHz_internal.bootloader.sut_cksel_bits=100001
16.menu.clock.1MHz_internal.bootloader.ckopt_bit=1
16.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
#### ATmega8535  ####
#####################

# General
8535.name=ATmega8535
8535.upload.tool=avrdude
8535.upload.maximum_data_size=512
8535.bootloader.tool=avrdude
8535.bootloader.unlock_bits=0xff
8535.bootloader.lock_bits=0xff
8535.bootloader.low_fuses=0b{bootloader.bod_bits}{bootloader.sut_cksel_bits}
8535.bootloader.high_fuses=0b110{bootloader.ckopt_bit}{bootloader.eesave_bit}111
8535.build.core=MCUdude_corefiles
8535.build.board=AVR_ATmega8535
8535.build.mcu=atmega8535
8535.debug.executable=

# Upload port select
8535.menu.bootloader.uart0=Yes (UART0)
8535.menu.bootloader.uart0.upload.maximum_size=7808
8535.menu.bootloader.uart0.upload.protocol=urclock
8535.menu.bootloader.uart0.upload.uartpins=uart0_rxd0_txd1
8535.menu.bootloader.uart0.build.export_merged_output=true
8535.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

8535.menu.bootloader.no_bootloader=No bootloader
8535.menu.bootloader.no_bootloader.upload.maximum_size=8192
8535.menu.bootloader.no_bootloader.build.export_merged_output=false
8535.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
8535.menu.eeprom.keep=EEPROM retained
8535.menu.eeprom.keep.bootloader.eesave_bit=0
8535.menu.eeprom.erase=EEPROM not retained
8535.menu.eeprom.erase.bootloader.eesave_bit=1

# Baud rate
8535.menu.baudrate.default=Default
8535.menu.baudrate.default.upload.speed={upload.default_speed}
8535.menu.baudrate.1000000=1000000
8535.menu.baudrate.1000000.upload.speed=1000000
8535.menu.baudrate.500000=500000
8535.menu.baudrate.500000.upload.speed=500000
8535.menu.baudrate.460800=460800
8535.menu.baudrate.460800.upload.speed=460800
8535.menu.baudrate.250000=250000
8535.menu.baudrate.250000.upload.speed=250000
8535.menu.baudrate.230400=230400
8535.menu.baudrate.230400.upload.speed=230400
8535.menu.baudrate.125000=125000
8535.menu.baudrate.125000.upload.speed=125000
8535.menu.baudrate.115200=115200
8535.menu.baudrate.115200.upload.speed=115200
8535.menu.baudrate.57600=57600
8535.menu.baudrate.57600.upload.speed=57600
8535.menu.baudrate.38400=38400
8535.menu.baudrate.38400.upload.speed=38400
8535.menu.baudrate.19200=19200
8535.menu.baudrate.19200.upload.speed=19200
8535.menu.baudrate.9600=9600
8535.menu.baudrate.9600.upload.speed=9600
8535.menu.baudrate.4800=4800
8535.menu.baudrate.4800.upload.speed=4800

# Pinouts
8535.menu.pinout.standard=Standard pinout
8535.menu.pinout.standard.build.variant=standard
8535.menu.pinout.standard.build.bootloader_led=led+b0
8535.menu.pinout.bobuino=Bobuino pinout
8535.menu.pinout.bobuino.build.variant=bobuino
8535.menu.pinout.bobuino.build.bootloader_led=led+b7
8535.menu.pinout.sanguino=Sanguino pinout
8535.menu.pinout.sanguino.build.variant=sanguino
8535.menu.pinout.sanguino.build.bootloader_led=led+b0

# Brown out detection - This is the first part of the low fuse bit concatenation
8535.menu.BOD.2v7=BOD 2.7V
8535.menu.BOD.2v7.bootloader.bod_bits=10
8535.menu.BOD.4v0=BOD 4.0V
8535.menu.BOD.4v0.bootloader.bod_bits=00
8535.menu.BOD.disabled=BOD disabled
8535.menu.BOD.disabled.bootloader.bod_bits=11

# Compiler link time optimization
8535.menu.LTO.Os_flto=LTO enabled
8535.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
8535.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
8535.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
8535.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

8535.menu.LTO.Os=LTO disabled
8535.menu.LTO.Os.compiler.c.extra_flags=
8535.menu.LTO.Os.compiler.c.elf.extra_flags=
8535.menu.LTO.Os.compiler.cpp.extra_flags=
8535.menu.LTO.Os.ltoarcmd=avr-ar

# Clock frequencies - This is the second part of the low fuse bit concatenation
8535.menu.clock.16MHz_external=External 16 MHz
8535.menu.clock.16MHz_external.upload.default_speed=115200
8535.menu.clock.16MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.16MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.16MHz_external.build.f_cpu=16000000L

8535.menu.clock.20MHz_external=External 20 MHz
8535.menu.clock.20MHz_external.upload.default_speed=115200
8535.menu.clock.20MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.20MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.20MHz_external.build.f_cpu=20000000L

8535.menu.clock.18_432MHz_external=External 18.4320 MHz
8535.menu.clock.18_432MHz_external.upload.default_speed=115200
8535.menu.clock.18_432MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.18_432MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.18_432MHz_external.build.f_cpu=18432000L

8535.menu.clock.14_7456MHz_external=External 14.7456 MHz
8535.menu.clock.14_7456MHz_external.upload.default_speed=115200
8535.menu.clock.14_7456MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.14_7456MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

8535.menu.clock.12MHz_external=External 12 MHz
8535.menu.clock.12MHz_external.upload.default_speed=57600
8535.menu.clock.12MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.12MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.12MHz_external.build.f_cpu=12000000L

8535.menu.clock.11_0592MHz_external=External 11.0592 MHz
8535.menu.clock.11_0592MHz_external.upload.default_speed=115200
8535.menu.clock.11_0592MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.11_0592MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

8535.menu.clock.9_216MHz_external=External 9.216 MHz
8535.menu.clock.9_216MHz_external.upload.default_speed=115200
8535.menu.clock.9_216MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.9_216MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.9_216MHz_external.build.f_cpu=9216000L

